### Nettoyez dataset

In [2]:
import pandas as pd

In [3]:
# liste = [5,10,20,5]
# import numpy as np
# np.mean(liste)

# liste = [5,10, np.nan ,20,5]
# np.nanmean(liste)

#### Identifier les doublons

In [4]:
fp = "https://bit.ly/tx-data"
print(fp)

https://bit.ly/tx-data

In [5]:
df = pd.read_csv(fp)

In [6]:
df.head()

  transaction_id first_name  last_name       ip_address   amount
0      50563-403     Jacobo   Haresign    18.144.134.48  $647.77
1     54569-3911    Christy       Derl  254.107.123.242  $460.47
2     59667-0024     Florie     Prewer    148.80.11.233  $565.38
3      60429-123     Danika     Shimuk   233.91.221.158  $794.76
4      0187-0771   Annelise  Antonescu   238.143.41.105  $790.41

In [7]:
df.shape

(48, 5)

In [8]:
df.dtypes

transaction_id    object
first_name        object
last_name         object
ip_address        object
amount            object
dtype: object

In [9]:
df[df.duplicated()]

   transaction_id first_name   last_name       ip_address   amount
15      68180-751     Marlon      Fernie   61.133.100.141  $974.30
19      53942-299      Upton        Emig  103.190.123.125  $759.53
20      60289-247      Corri  Rockcliffe    46.150.208.18    $5.68
28     59667-0024     Florie      Prewer    148.80.11.233  $565.38
32      65862-207     Alvira      Heifer   141.170.128.72  $584.13
37      65862-207     Alvira      Heifer   141.170.128.72  $584.13
42      0066-0508       Jedd     Hartman     21.55.247.91  $749.96

In [10]:
df[df.duplicated(keep=False)]   # keep=False pour afficher des doublons

   transaction_id first_name   last_name       ip_address   amount
2      59667-0024     Florie      Prewer    148.80.11.233  $565.38
5       53942-299      Upton        Emig  103.190.123.125  $759.53
7       60289-247      Corri  Rockcliffe    46.150.208.18    $5.68
12      68180-751     Marlon      Fernie   61.133.100.141  $974.30
14      65862-207     Alvira      Heifer   141.170.128.72  $584.13
15      68180-751     Marlon      Fernie   61.133.100.141  $974.30
16      0066-0508       Jedd     Hartman     21.55.247.91  $749.96
19      53942-299      Upton        Emig  103.190.123.125  $759.53
20      60289-247      Corri  Rockcliffe    46.150.208.18    $5.68
28     59667-0024     Florie      Prewer    148.80.11.233  $565.38
32      65862-207     Alvira      Heifer   141.170.128.72  $584.13
37      65862-207     Alvira      Heifer   141.170.128.72  $584.13
42      0066-0508       Jedd     Hartman     21.55.247.91  $749.96

In [11]:
df.shape

(48, 5)

In [12]:
df[df.duplicated(subset=['transaction_id'])]  # par colonne

   transaction_id first_name   last_name       ip_address   amount
15      68180-751     Marlon      Fernie   61.133.100.141  $974.30
19      53942-299      Upton        Emig  103.190.123.125  $759.53
20      60289-247      Corri  Rockcliffe    46.150.208.18    $5.68
28     59667-0024     Florie      Prewer    148.80.11.233  $565.38
32      65862-207     Alvira      Heifer   141.170.128.72  $584.13
37      65862-207     Alvira      Heifer   141.170.128.72  $584.13
42      0066-0508       Jedd     Hartman     21.55.247.91  $749.96

In [13]:
df.shape

(48, 5)

In [14]:
df[df.duplicated(subset=['first_name'])]  # par colonne

   transaction_id first_name   last_name       ip_address   amount
15      68180-751     Marlon      Fernie   61.133.100.141  $974.30
19      53942-299      Upton        Emig  103.190.123.125  $759.53
20      60289-247      Corri  Rockcliffe    46.150.208.18    $5.68
28     59667-0024     Florie      Prewer    148.80.11.233  $565.38
29     43857-0134     Sergio  Whittlesee   76.116.223.149  $346.11
32      65862-207     Alvira      Heifer   141.170.128.72  $584.13
37      65862-207     Alvira      Heifer   141.170.128.72  $584.13
42      0066-0508       Jedd     Hartman     21.55.247.91  $749.96

In [15]:
df.isna().sum()

transaction_id    0
first_name        0
last_name         0
ip_address        0
amount            0
dtype: int64

#### Supprimer les doublons

In [16]:
df.duplicated().sum()  ## compter des doublons

7

In [17]:
df.drop_duplicates(subset = ['transaction_id'], inplace = True)

In [18]:
#df.drop_duplicates().duplicated().sum()

In [19]:
df.shape  # pour vérifier si drop a fonctionné

(41, 5)

* Sauvegarder des données propres

In [20]:
df.to_csv("transaction.csv" , sep = ";")

## Gérer des valeurs manquantes

In [21]:
fp_test = 'https://bit.ly/missing-values'
print(fp_test)

https://bit.ly/missing-values

In [22]:
df = pd.read_csv(fp_test)
df.head()
df2 = df
df3 = df

In [23]:
df.head(10)

    color  rating
0     NaN    1.16
1     Red     NaN
2    Blue    2.54
3     Red    1.51
4     Red     NaN
5    Blue     NaN
6     NaN    4.25
7    Blue     NaN
8     NaN    1.75
9  Orange    3.21

In [24]:
df.shape

(917, 2)

In [25]:
df.dtypes

color      object
rating    float64
dtype: object

#### Idenfier les NaN

In [26]:
df.isna()

     color  rating
0     True   False
1    False    True
2    False   False
3    False   False
4    False    True
..     ...     ...
912  False   False
913  False    True
914   True   False
915  False   False
916  False    True

[917 rows x 2 columns]

In [27]:
df.isna().sum()

color     129
rating    256
dtype: int64

In [28]:
df.isna().mean()   # pourcentage

color     0.140676
rating    0.279171
dtype: float64

In [29]:
df['color'].value_counts() # les effectifs pour chaque modalité

color
Blue      323
Red       234
Orange    154
Yellow     77
Name: count, dtype: int64

In [30]:
df['color'].value_counts(dropna=False)  # effectifs par catégorie avec NAN

color
Blue      323
Red       234
Orange    154
NaN       129
Yellow     77
Name: count, dtype: int64

In [31]:
# df['rating'].value_counts(dropna=False)

* dropna

In [32]:
df4 = df.dropna()  # dropna supprime toutes les lignes contenant au moins une NAN
df4.shape

(532, 2)

* all

In [33]:
df3 = df.dropna(how = 'all',subset = ['color','rating'])   
print(df3.shape)
df3.head()
# all : si toutes les valeurs sont manquante dans subset, jetter la ligne

(917, 2)

  color  rating
0   NaN    1.16
1   Red     NaN
2  Blue    2.54
3   Red    1.51
4   Red     NaN

* any

In [34]:
df2 = df2.dropna(how = 'any', subset = ['color'])   
print(df2.shape)
df2.head()
# any : si une seulle valeur est manquante dans subset, jetter la ligne

(788, 2)

  color  rating
1   Red     NaN
2  Blue    2.54
3   Red    1.51
4   Red     NaN
5  Blue     NaN

#### Remplire les NaN

1 Remplir avec la valeur la plus courante

2 Remplir avec la moyenne

3 Remplir avec une valeur hors de l'echelle de la valeur des non manquantes

In [35]:
fp_test = 'https://bit.ly/missing-values'
print(fp_test)

df = pd.read_csv(fp_test)
df2 = pd.read_csv(fp_test)
df3 = pd.read_csv(fp_test)
df.head()

https://bit.ly/missing-values

  color  rating
0   NaN    1.16
1   Red     NaN
2  Blue    2.54
3   Red    1.51
4   Red     NaN

###### 1 Remplir avec la valeur la plus courante

In [36]:
#df['color'].value_counts(dropna=False)   # Blue      323

In [37]:
df['color'].fillna('Blue')   # on rample Nan par Blue

0        Blue
1         Red
2        Blue
3         Red
4         Red
        ...
912      Blue
913       Red
914      Blue
915    Yellow
916      Blue
Name: color, Length: 917, dtype: object

In [38]:
df.isna().sum()

color     129
rating    256
dtype: int64

In [39]:
df.head()

  color  rating
0   NaN    1.16
1   Red     NaN
2  Blue    2.54
3   Red    1.51
4   Red     NaN

In [40]:
df['color'].fillna('Blue', inplace = True)

In [41]:
df.isna().sum()

color       0
rating    256
dtype: int64

In [42]:
df.head()

  color  rating
0  Blue    1.16
1   Red     NaN
2  Blue    2.54
3   Red    1.51
4   Red     NaN

###### 2 Remplir avec la moyenne

In [43]:
m = df['rating'].mean()  # median
m

3.0666717095310134

In [44]:
df['rating'].fillna(m, inplace = True)

In [45]:
df.head()

  color    rating
0  Blue  1.160000
1   Red  3.066672
2  Blue  2.540000
3   Red  1.510000
4   Red  3.066672

In [46]:
#df["rating2"] = df["rating"]*100

In [47]:
df.insert(loc=1, column='rating_double', value=df["rating"]*2)
df

      color  rating_double    rating
0      Blue       2.320000  1.160000
1       Red       6.133343  3.066672
2      Blue       5.080000  2.540000
3       Red       3.020000  1.510000
4       Red       6.133343  3.066672
..      ...            ...       ...
912    Blue       6.800000  3.400000
913     Red       6.133343  3.066672
914    Blue       2.480000  1.240000
915  Yellow       5.280000  2.640000
916    Blue       6.133343  3.066672

[917 rows x 3 columns]

In [48]:
df.head()

  color  rating_double    rating
0  Blue       2.320000  1.160000
1   Red       6.133343  3.066672
2  Blue       5.080000  2.540000
3   Red       3.020000  1.510000
4   Red       6.133343  3.066672

In [49]:
df.isna().sum()

color            0
rating_double    0
rating           0
dtype: int64

In [50]:
df.head()

  color  rating_double    rating
0  Blue       2.320000  1.160000
1   Red       6.133343  3.066672
2  Blue       5.080000  2.540000
3   Red       3.020000  1.510000
4   Red       6.133343  3.066672

###### 3 Remplir avec une valeur hors de l'echelle de la valeur des non manquantes

In [51]:
df3['color'].fillna('Missing', inplace = True)   # Autre

In [52]:
df3.isna().sum()

color       0
rating    256
dtype: int64

In [53]:
df3['rating'].min()

1.0

In [54]:
df3['rating'].max()

5.0

In [55]:
## On peut choisir 0

In [56]:
df3['rating'].fillna(0, inplace = True)

In [57]:
df3.head()

     color  rating
0  Missing    1.16
1      Red    0.00
2     Blue    2.54
3      Red    1.51
4      Red    0.00

In [58]:
df3.isna().sum()

color     0
rating    0
dtype: int64

In [59]:
fp = 'https://bit.ly/missing-values'
print(fp)

df5 = pd.read_csv(fp)
df5

https://bit.ly/missing-values

      color  rating
0       NaN    1.16
1       Red     NaN
2      Blue    2.54
3       Red    1.51
4       Red     NaN
..      ...     ...
912    Blue    3.40
913     Red     NaN
914     NaN    1.24
915  Yellow    2.64
916    Blue     NaN

[917 rows x 2 columns]

In [60]:
df5['rating'] = df5['rating'].interpolate(method="linear")
df5

      color    rating
0       NaN  1.160000
1       Red  1.850000
2      Blue  2.540000
3       Red  1.510000
4       Red  2.423333
..      ...       ...
912    Blue  3.400000
913     Red  2.320000
914     NaN  1.240000
915  Yellow  2.640000
916    Blue  2.640000

[917 rows x 2 columns]